{
  "backend/main.mo": "Motoko canister managing user profiles and daily follower lists with access control checks for viewing and saving data.",
  "feature_evidence.json": "Empty feature evidence report placeholder.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their roles and features.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables, dark mode values, and global background/text styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup flow, and rendering the notebook interface with optional follower wall.",
  "frontend/src/components/auth/LoginButton.tsx": "Button controlling Internet Identity login/logout with status handling and cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "A dialog component that collects and submits a user's name during profile setup.",
  "frontend/src/components/FollowerListEditor.tsx": "Editor component for adding, editing, and removing follower names with inline controls.",
  "frontend/src/components/FollowerWall.tsx": "Background component rendering uniquely styled follower names in randomized positions.",
  "frontend/src/components/LoadSaveStatus.tsx": "Displays loading skeletons, error alerts, or saving indicators for follower data operations.",
  "frontend/src/components/NotebookPage.tsx": "Notebook page managing date-based follower lists, save actions, and unsaved-change warnings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDailyFollowers.ts": "Hooks for fetching, saving, and aggregating daily follower lists using the backend actor with react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Hooks for fetching and updating the caller's user profile and role using the backend actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining a notebook-themed UI with light and dark palettes.",
  "frontend/src/main.tsx": "App entry point that initializes React, react-query, and the Internet Identity provider.",
  "frontend/src/utils/date.ts": "Utility functions for formatting, normalizing, and retrieving ISO-formatted dates.",
  "frontend/src/utils/urlParams.ts": "Helpers for extracting, persisting, and clearing URL and session parameters.",
  "frontend/src/vite-env.d.ts": "Type declarations for Vite environment variables.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, typography, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the project’s state, features, issues, and architecture for a notebook-style single-page app with daily and aggregated follower-name storage."
}